RyanHailey21/esp32_drone/Mission.cpp
        // ── HOVER TEST ───────────────────────────────────────
        case HOVER_TEST:
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = hoverTestAngleModeChannelValue();
            // Ramp toward HOVER_THROTTLE at ~200 µs/s so a rapid step from the
            // ARMING low-throttle doesn't trigger Betaflight's ANTI_GRAVITY I-term boost.
            if (channels[CH_THROTTLE] < (uint16_t)HOVER_THROTTLE) {
                channels[CH_THROTTLE] = min((uint16_t)(channels[CH_THROTTLE] + HOVER_RAMP_STEP_US),
                                            (uint16_t)HOVER_THROTTLE);
            } else {
                channels[CH_THROTTLE] = HOVER_THROTTLE;
            }
            sendRC();
            digitalWrite(STATUS_LED, millis() % 500 < 250);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[HOVER] throttle=%d  target=%d  angleAux=%d\n",
                channels[CH_THROTTLE], (int)HOVER_THROTTLE, channels[CH_ANGLE]);
#endif
            break;

        // ── AUTO HOVER CAL ───────────────────────────────────
        case AUTO_HOVER_CAL:
            channels[CH_ARM]      = 1800;
            channels[CH_ANGLE]    = hoverTestAngleModeChannelValue();
            channels[CH_THROTTLE] = calThrottle;
            sendRC();
            digitalWrite(STATUS_LED, millis() % 300 < 150);

            if (millis() - calStepTime >= CAL_STEP_MS) {
                calStepTime = millis();
                if (calThrottle < CAL_MAX_THROTTLE) calThrottle += CAL_STEP_US;
            }

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[AUTO_HOVER] alt=%.2fm  throttle=%d\n", altitude, calThrottle);
#endif

            if (altitude >= CAL_LIFTOFF_M) calLiftoffCount++;
            else                            calLiftoffCount = 0;

            if (calLiftoffCount >= 5) {
                HOVER_THROTTLE = constrain(calThrottle + CAL_GE_OFFSET_US, 1200, 1600);
                if (hoverChar) hoverChar->setValue((uint8_t*)&HOVER_THROTTLE, 2);
                channels[CH_THROTTLE] = HOVER_THROTTLE;
                sendRC();
                state = HOVER_TEST;
#if SERIAL_FLIGHT_DEBUG
                Serial.printf("[AUTO_HOVER] liftoff confirmed (%d counts), HOVER_THROTTLE=%d -> HOVER TEST\n",
                    calLiftoffCount, HOVER_THROTTLE);
#endif
                break;
            }

            if (calThrottle >= CAL_MAX_THROTTLE || millis() - calTime >= CAL_TIMEOUT_MS) {
                disarmToIdle("[AUTO_HOVER] Calibration failed -> IDLE");
            }
            break;

        // ── ALT HOLD ─────────────────────────────────────────
        case ALT_HOLD: {
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();

            uint16_t thr;
            uint32_t timeInAltHold = millis() - (armTime + ARMING_MS);
            float controlAlt = altitude;
            float tofAgl = lastTofValid ? lastTofAltM : altitude;
            if (timeInAltHold < BARO_SETTLE_MS) {
                altHoldGuardPhase = 0;
                launchAlt = rawAlt;
                altHoldCascadeLatched = false;
                thr = takeoffGuardThrottle(timeInAltHold, lastTofValid);
                resetCascadeController(0.0f);
                if (timeInAltHold % 100 < 20) {
#if SERIAL_FLIGHT_DEBUG
                    Serial.printf("[ALT_HOLD] settle  t=%ums rawAlt=%.2f launchAlt=%.2f rel=%.2f tof=%.2f tofW=%u\n",
                        timeInAltHold, rawAlt, launchAlt, altitude, tofAgl, lastTofWeightPct);
#endif
                }
            } else if (!altHoldCascadeLatched) {
                altHoldCascadeLatched = true;
                altHoldGuardPhase = 2;
                primeCascadeController(controlAlt);
                thr = holdCascaded(controlAlt, false);
#if SERIAL_FLIGHT_DEBUG
                Serial.printf("[ALT_HOLD] cascade active after settle rel=%.2f tof=%.2f tofW=%u\n",
                    altitude, tofAgl, lastTofWeightPct);
#endif
            } else {
                altHoldGuardPhase = 2;
                thr = holdCascaded(controlAlt, false);
            }
            if (altHoldGuardPhase != 2) {
                lastAltError = 0.0f;
                lastDesiredVspeed = 0.0f;
                lastVspeedError = 0.0f;
                lastControlPUs = 0.0f;
                lastControlIUs = 0.0f;
                lastRawThrottle = thr;
                lastThrMin = thr;
                lastThrMax = thr;
                lastClampedThrottle = thr;
                lastThrottleSat = 0;
            }
            channels[CH_THROTTLE] = thr;
            sendRC();
            logFlightSample(timeInAltHold, altHoldGuardPhase == 0 ? "settle" : "cascade",
                controlAlt, controlAlt, thr);
            digitalWrite(STATUS_LED, millis() % 500 < 250);

            // Tight safety ceiling: if baro or controller misbehaves, land before getting dangerous.
            float holdTarget  = constrain((float)ALT_HOLD_TARGET_M, ALT_HOLD_TARGET_MIN_M, ALT_HOLD_TARGET_MAX_M);
            float safeCeiling = holdTarget + 2.0f;
            if (controlAlt > safeCeiling) {
#if SERIAL_FLIGHT_DEBUG
                Serial.printf("[ALT_HOLD] safety ceiling %.1fm exceeded at %.2fm, landing\n", safeCeiling, controlAlt);
#endif
                startLanding(controlAlt);
            }
            if (attitudeAbortActive()) {
                disarmToIdle("[ALT_HOLD] attitude abort");
            }
            break;
        }

        // ── LANDING ──────────────────────────────────────────
        case LANDING: {
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();
            digitalWrite(STATUS_LED, millis() % 200 < 30);
            if (attitudeAbortActive()) {
                disarmToIdle("[LANDING] attitude abort");
                break;
            }

            // ToF can detect ground immediately. Baro/fused fallback must first
            // show real descent so a stale zero cannot kill motors mid-air.
            float landingAlt = altitude;
            float tofAgl = lastTofValid ? lastTofAltM : altitude;
            bool hasDescended = (landingStartAlt - landingAlt) > 0.3f;
            bool tofGround = lastTofValid && lastTofWeightPct >= 80 && lastTofAltM <= LANDING_GROUND_M;
            bool fallbackGround = !tofGround && hasDescended && landingAlt <= LANDING_GROUND_M;
            bool startedOnGround = landingStartAlt <= LANDING_GROUND_M && landingAlt <= LANDING_GROUND_M;
            if (tofGround || fallbackGround || startedOnGround) {
                disarmToIdle("[LANDING] ground detected");
                break;
            }
            if (millis() - landingStartMs >= LANDING_TIMEOUT_MS) {
                disarmToIdle("[LANDING] timeout");
                break;
            }

            bool landingVarioFresh = (millis() - lastVarioMs) < VARIO_STALE_MS
                                      && abs(lastVario) <= VARIO_MAX_PLAUSIBLE_CMS;
            float landingVario = landingVarioFresh ? lastVario / 100.0f : filteredVario;
            float predictedLandingAlt = max(0.0f, landingAlt + landingVario * LANDING_LOOKAHEAD_S);
            float targetDescentMps = DESCENT_RATE_MPS;
            float landingOffsetUs = LANDING_THROTTLE_OFFSET_US;
            if (predictedLandingAlt <= LANDING_FINAL_ALT_M) {
                targetDescentMps = LANDING_FINAL_DESCENT_MPS;
                landingOffsetUs = LANDING_FINAL_OFFSET_US;
            } else if (predictedLandingAlt <= LANDING_FLARE_ALT_M) {
                float u = (predictedLandingAlt - LANDING_FINAL_ALT_M) / (LANDING_FLARE_ALT_M - LANDING_FINAL_ALT_M);
                targetDescentMps = LANDING_FINAL_DESCENT_MPS
                    + u * (LANDING_FLARE_DESCENT_MPS - LANDING_FINAL_DESCENT_MPS);
                landingOffsetUs = LANDING_FINAL_OFFSET_US
                    + u * (LANDING_FLARE_OFFSET_US - LANDING_FINAL_OFFSET_US);
            }

            uint32_t landingElapsedMs = millis() - landingStartMs;
            if (landingElapsedMs < LANDING_ENTRY_RAMP_MS) {
                float ramp = landingElapsedMs / (float)LANDING_ENTRY_RAMP_MS;
                landingOffsetUs = LANDING_ENTRY_START_OFFSET_US
                    + ramp * (landingOffsetUs - LANDING_ENTRY_START_OFFSET_US);
            }

            float rateError           = (-targetDescentMps) - landingVario;
            int16_t correction        = (int16_t)(LANDING_KP_VSPEED * rateError);
            float landingBaseThrottle = max((float)MIN_ALT_HOLD_THROTTLE_US,
                                            (float)HOVER_THROTTLE - landingOffsetUs);
            float landingRawThrottle  = landingBaseThrottle + correction;
            float landingMinThrottle  = max(1000.0f, (float)HOVER_THROTTLE - (float)LANDING_MIN_BELOW_HOVER_US);
            if (predictedLandingAlt <= LANDING_LOW_ALT_FLOOR_M && landingVario < -LANDING_FINAL_DESCENT_MPS) {
                float descentMps = -landingVario;
                float speedU = (descentMps - LANDING_FINAL_DESCENT_MPS)
                    / (LANDING_FAST_DESCENT_MPS - LANDING_FINAL_DESCENT_MPS);
                speedU = constrain(speedU, 0.0f, 1.0f);
                float floorOffsetUs = LANDING_LOW_ALT_MIN_OFFSET_US
                    + speedU * (LANDING_FAST_DESCENT_MIN_OFFSET_US - LANDING_LOW_ALT_MIN_OFFSET_US);
                landingMinThrottle = max(landingMinThrottle, (float)HOVER_THROTTLE - floorOffsetUs);
            }
            float landingMaxThrottle  = (float)HOVER_THROTTLE + 80.0f;
            float landingClampedThrottle = constrain(landingRawThrottle, landingMinThrottle, landingMaxThrottle);
            if (lastClampedThrottle > 0) {
                float minSlewThrottle = max(landingMinThrottle, (float)lastClampedThrottle - (float)THROTTLE_SLEW_DOWN_US);
                float maxSlewThrottle = min(landingMaxThrottle, (float)lastClampedThrottle + (float)THROTTLE_SLEW_UP_US);
                landingClampedThrottle = constrain(landingClampedThrottle, minSlewThrottle, maxSlewThrottle);
            }
            channels[CH_THROTTLE]     = (uint16_t)landingClampedThrottle;
            lastAltError = 0.0f;
            lastDesiredVspeed = -targetDescentMps;
            lastVspeedError = rateError;
            lastControlPUs = correction;
            lastControlIUs = 0.0f;
            lastRawThrottle = landingRawThrottle;
            lastThrMin = landingMinThrottle;
            lastThrMax = landingMaxThrottle;
            lastClampedThrottle = channels[CH_THROTTLE];
            lastThrottleSat = landingRawThrottle > landingClampedThrottle ? 1 : (landingRawThrottle < landingClampedThrottle ? -1 : 0);
            sendRC();
            logFlightSample(millis() - landingStartMs, "landing", landingAlt, landingAlt, channels[CH_THROTTLE]);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[LANDING] alt=%.2fm  tof=%.2f  controlV=%.2f filtV=%.2f  thr=%d\n",
                landingAlt, tofAgl, landingVario, filteredVario, channels[CH_THROTTLE]);
#endif
            break;
        }

        case DONE:
            sendRC();
            digitalWrite(STATUS_LED, millis() % 100 < 50);
            break;
    }
}
